tfmacs/README.org
#+title: Emacs configuration
* Table of contents :TOC:
- [[#introduction][Introduction]]
- [[#configuration][Configuration]]
  - [[#authenticationel][authentication.el]]
  - [[#ciel][ci.el]]
  - [[#completionel][completion.el]]
  - [[#data-scienceel][data-science.el]]
  - [[#defaultsel][defaults.el]]
  - [[#dev-envel][dev-env.el]]
  - [[#directoryel][directory.el]]
  - [[#emacs-debuggingel][emacs-debugging.el]]
  - [[#emacs-miscel][emacs-misc.el]]
  - [[#evilel][evil.el]]
  - [[#feedel][feed.el]]
  - [[#infrastructureel][infrastructure.el]]
  - [[#latexel][latex.el]]
  - [[#eglotel][eglot.el]]
  - [[#nixel][nix.el]]
  - [[#orgel][org.el]]
  - [[#persistenceel][persistence.el]]
  - [[#pythonel][python.el]]
  - [[#repeatingel][repeating.el]]
  - [[#roamel][roam.el]]
  - [[#systemel][system.el]]
  - [[#terminalel][terminal.el]]
  - [[#text-editingel][text-editing.el]]
  - [[#themingel][theming.el]]
  - [[#version-controlel][version-control.el]]
  - [[#whitespaceel][whitespace.el]]
  - [[#windowel][window.el]]
  - [[#workspacesel][workspaces.el]]
  - [[#keybindingsel][keybindings.el]]
- [[#patches][Patches]]
  - [[#asdf-reshim][asdf-reshim]]
  - [[#asdf-transient][asdf-transient]]
  - [[#org-sticky-header][org-sticky-header]]
  - [[#lisp][lisp]]
- [[#experimentation][Experimentation]]
  - [[#drag-stuff][Drag-stuff]]
  - [[#move-text][Move-text]]
  - [[#buffer-removal][Buffer removal]]
  - [[#latex-command-shortcuts][LaTeX command shortcuts]]
  - [[#yasnippet][Yasnippet]]
  - [[#popper][Popper]]
  - [[#shackle][Shackle]]
  - [[#ejc-sql][Ejc-sql]]
  - [[#eldoc][ElDoc]]
  - [[#aggressive-indent-mode][Aggressive-indent-mode]]
  - [[#evil-snipe][Evil-snipe]]
  - [[#desktop][Desktop]]
  - [[#ovpn-mode][ovpn-mode]]
  - [[#fontaine][fontaine]]
  - [[#emojify][emojify]]
  - [[#flycheck-inline][flycheck-inline]]
  - [[#hledger-mode--flycheck-hledger][hledger-mode / flycheck-hledger]]
  - [[#multiple-cursors][multiple-cursors]]
  - [[#git-undo][git-undo]]
  - [[#expand-region][expand-region]]
  - [[#fix-word][fix-word]]
  - [[#zoxide][zoxide]]
  - [[#visual-regexp-steroids][visual-regexp-steroids]]
  - [[#minimap][minimap]]
  - [[#firestarter][firestarter]]
  - [[#org-transclusion][org-transclusion]]
  - [[#dap-mode][dap-mode]]
  - [[#org-ref][org-ref]]
  - [[#notmuch][notmuch]]
  - [[#password-store][password-store]]
  - [[#0x0][0x0]]
  - [[#goto-last-change][goto-last-change]]
  - [[#lispy--lispyville][lispy / lispyville]]
  - [[#interesting-org-mode-options][Interesting org mode options]]
  - [[#mode-line-idle][mode-line-idle]]
  - [[#tree-sitter][tree-sitter]]
  - [[#screenshot][screenshot]]
  - [[#relative-date][relative-date]]
  - [[#taxy][taxy]]
  - [[#modus-theme][modus-theme]]
  - [[#asynchronous-fuzzy-file-finding-for-emacs][Asynchronous fuzzy-file finding for Emacs]]
  - [[#openstreetmap-viewer-for-emacs][OpenStreetMap viewer for Emacs]]
  - [[#miscellaneous-ideas][Miscellaneous ideas]]

* Introduction
This repository contains the code used to set up my Emacs environment.
Clone this repository to .emacs.d and the rest of the configuration
will bootstrap itself upon starting up.

Straight is used as a package manager and use-package to define the
package configuration. Straight is integrated into use-package, so
that each declaration of a package automatically calls
`straight-use-package`.

Upon start up, the elisp code blocks in the configuration section of
this file are tangled into a separate directory called `tangled/config/`. This
directory is then loaded using init-loader.

Although the `tangled/config/` directory is recreated upon every start up, for
an easier time understanding the code, I have opted to include the
generated modules as well.

Finally, the glue code that is needed to bring all these pieces
together or add some features to packages I feel is missing, has been
turned into a separate package called band-aid.

* Configuration
** authentication.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_authentication.el

  (use-package pinentry
    :custom (epg-pinentry-mode 'loopback)
    :config (pinentry-start))

#+end_src

** ci.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_ci.el

  (use-package gitlab-ci-mode
    ;; I either put my gitlab-ci files in .gitlab-ci.yml or inside the .gitlab folder.
    :mode "\\.gitlab/.*\\.ya?ml")

#+end_src

** completion.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_completion.el

  (use-package vertico
    ;; Vertico stores its extensions in a separate directory.
    ;; Straight needs to be able to find this directory.
    :straight
    (:files (:defaults "extensions/*")
     :includes
     (vertico-buffer
      vertico-directory
      vertico-flat
      vertico-indexed
      vertico-mouse
      vertico-quick
      vertico-repeat
      vertico-reverse))
    ;; BUG: It seems `vertico-count' set to 5 does not work with `vertico-buffer'.
    ;;:custom (vertico-count 5)
    :config (vertico-mode 1))

  (use-feature vertico-buffer
    :after vertico
    :custom
    ;; The confusing thing is that the buffer is still underneath the rest when using windmove.
    (vertico-buffer-display-action
     `(display-buffer-in-side-window
       (window-height . ,(+ 3 vertico-count))
       (side . top)))
    (vertico-buffer-mode 1))

  (use-feature vertico-directory
    :after vertico
    ;; TODOC: What is the `rfn-eshadow-update-overlay-hook' and when does it trigger?
    ;; TODOC: What does the `vertico-directory-tidy' function do?
    :hook (rfn-eshadow-update-overlay . vertico-directory-tidy)
    ;; IDEA: I should rewrite this with the general package. Which keybindings would make sense?
    :bind
    (:map vertico-map
     ("RET" . vertico-directory-enter)
     ("DEL" . vertico-directory-delete-char)
     ("M-DEL" . vertico-directory-delete-word)))

  (use-package orderless
    :custom
    (completion-styles '(orderless))
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles . (partial-completion)))))
    ;; orderless-flex ends up giving too many candidates.
    (orderless-matching-styles '(orderless-prefixes)))

  ;; consult-find
  ;; consult-ripgrep
  ;; consult-yank are useful functions.
  (use-package consult)

  (use-package marginalia
    :custom (marginalia-mode 1))

  ;; IDEA: To start understanding how I could use embark, I should put together a number of examples.
  ;; - Open a file by selecting the text and running embark-act on it.
  (use-package embark
    :bind
    (("C-." . embark-act)
     ("M-." . embark-dwim)
     ("C-h B" . embark-bindings)))

  (use-package embark-consult)

  (use-package ace-window
    :custom
    (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
    :general
    ("s-w" 'ace-window))

  ;; There are some other useful functions that I could bind. I need to think about them.
  ;; BUG: Capital letters seem to be counted as two different matches.
  (use-package ctrlf
    :custom
    ;; So I can search multiple words separated by spaces.
    ;; If I ever need to search for a space, double space works.
    (ctrlf-default-search-style 'fuzzy)
    ;; So I can search and immediately change a word by going to the beginning.
    (ctrlf-go-to-end-of-match nil)
    (ctrlf-mode 1)
    :general
    ;; IDEA: I need better keypresses, because these are inconvient to press. What are some better options?
    ("s-g" 'ctrlf-forward-default)
    (:keymaps 'ctrlf-mode-map
     "s-j" 'ctrlf-forward-default
     "s-k" 'ctrlf-backward-default))

  (use-package corfu
    :custom
    (corfu-auto t)
    (corfu-auto-prefix 2)
    (corfu-cycle t)
    (corfu-auto-delay 0.1)
    :config (global-corfu-mode 1))

  (use-package prescient
    :config (prescient-persist-mode 1))

  ;; Can helpful be replaced somehow?
  ;; (use-package helpful
  ;;   :custom
  ;;   (describe-function-function #'helpful-callable)
  ;;   (describe-variable-function #'helpful-variable))

  (use-package which-key
    :config (which-key-mode 1))

#+end_src

** data-science.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_data-science.el

  (use-package yaml-mode)
  (use-package yaml-pro
    :straight (:type git :host github :repo "zkry/yaml-pro"))

  (use-package toml-mode)

  (use-package csv-mode
    :hook
    (csv-mode . csv-align-mode)
    (csv-mode . csv-guess-set-separator))

  ;; IDEA: It would be nice if I can open a separate buffer in SES mode to edit
  ;; a dataframe. I can do this using `ein:kernel-utils-pandas-to-ses', but what
  ;; about more generally?
  (use-package ein
    ;; Apparently this hook is necessary for undo inside ein.
    :hook (evil-local-mode . turn-on-undo-tree-mode)
    ;; I can set additional properties through ein:output-area-inlined-image-properties.
    :custom (ein:output-area-inlined-images t))

  ;; This comes with the very handy function `ein:kernel-utils-pandas-to-ses`.
  (use-package ein-kernel-utils
    :straight (:type git :host github :repo "millejoh/ein-kernel-utils")
    :after ein
    :init
    (use-package company)
    (use-package popup))

  ;; IDEA: Some spreadsheet tool would be a useful addition, but is SES mode
  ;; the best option? I know there is also a package `cell-mode' for example.
  (use-feature ses
    :hook (ses-mode . linum-mode))

#+end_src

** defaults.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_defaults.el

  (use-feature emacs
    :custom
    (mode-line-percent-position nil)
    ;; No custom file. Complete reproducibility.
    (custom-file null-device)
    ;; By default emacs requires two spaces after a period to end a sentence. This is an old default that interferes with evil.
    (sentence-end-double-space nil)
    ;; Without the visible bell, hitting the edges of a file will make an annoying noise.
    ;; TODOC: Is this really the case?
    (visible-bell t)
    :config (column-number-mode 1)
    :general ("s-x" 'keyboard-escape-quit))

  (use-feature patches/01_lisp)

#+end_src

