tfmacs/README.org
** evil.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_evil.el

  (use-package evil-escape
    :custom
    (evil-escape-unordered-key-sequence t)
    ;; I prefer not to use letters, because I find it disturbs my workflow
    ;; if I accidentally bump myself out of insert mode.
    ;; However, evil-escape is very convenient if it works as expected.
    ;; Therefore, I keep the delay at 0.1 and bind it to keys that
    ;; are never used together (period and comma).
    ;; IDEA: I only use this key sequence to return back to the normal state.
    ;; Can I make that implicit? I believe evil-escape can also be used for
    ;; various other `quit' functionalities.
    (evil-escape-key-sequence ".,")
    ;; Because I rarely use the escape key sequence in combination anyway,
    ;; there is no harm in setting the delay slightly higher to avoid not
    ;; being quick enough with the key-chord.
    (evil-escape-delay 0.2)
    :config (evil-escape-mode 1))

  (use-package evil
    :custom
    (evil-want-C-u-scroll t)
    (evil-want-C-i-jump nil)
    (evil-undo-system 'undo-tree)
    (evil-mode-line-format nil)
    :config (evil-mode 1)
    ;; Use visual line motions even outside of visual-line-mode buffers
    ;; TODOC: What does this do exactly?
    :general
    (:states 'motion
     "j" 'evil-next-visual-line
     "k" 'evil-previous-visual-line))

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal)

  ;; BUG: Sometimes comments too much. Why?
  (use-package evil-nerd-commenter
    :general
    ("s-#" 'evilnc-comment-or-uncomment-lines))

#+end_src

** feed.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_feed.el

  (use-package elfeed
    :general
    (:states 'normal
     :prefix core-keybindings-leader-key
     "f" 'elfeed))

  (use-package elfeed-org
    :after elfeed)
  ;;   :custom (rmh-elfeed-org-files (list "~/org/private/feeds.org"))
  ;;   :config (elfeed-org))

  (use-package elfeed-tube
    :after elfeed)

#+end_src

** infrastructure.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_infrastructure.el

  (use-package docker
    :general
    (:states 'normal
     :prefix core-keybindings-leader-key
     "d" 'docker))

  (use-package dockerfile-mode)
  (use-package docker-compose-mode)

  (use-package terraform-mode)
  (use-package company-terraform)

#+end_src

** latex.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_latex.el

  (use-package tex-mode
    :straight (:type built-in)
    :hook
    (LaTeX-mode . prettify-symbols-mode)
    (LaTeX-mode . TeX-fold-mode)
    (LaTeX-mode . latex-preview-pane-mode)
    :custom
    (TeX-auto-save t)
    (TeX-parse-self t))

  ;; The fact that straight needs to pull a different package from
  ;; the file that I actually need to require, comes from the
  ;; historical naming.
  (use-package tex
    :straight auctex
    :init (require 'texmathp))

  (use-package cdlatex
    :after tex
    ;; BUG: Something about this hook did not work. I do not remember what it was exactly.
    ;;:hook ((LaTeX-mode org-mode) . cdlatex-mode)
    :custom
    (cdlatex-math-modify-prefix ?')
    (cdlatex-math-symbol-prefix ?§)
    (qcdlatex-math-modify-alist
     '((?a "\\mathbb" nil t nil nil)))
    (cdlatex-env-alist
     '(("theorem" "\\begin{theorem}\nAUTOLABEL\n?\n\\end{theorem}\n" nil)))
    (cdlatex-command-alist
     '(("thr" "Insert theorem env" "" cdlatex-environment ("theorem") t nil)))
    :bind (:map cdlatex-mode-map
	   ("C-c e" . cdlatex-environment)
	   ("'" . cdlatex-math-modify)
	   ("§" . cdlatex-math-symbol)))

#+end_src

** eglot.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_eglot.el

  (use-package consult-eglot)
  ;; TODOC: What about ctags and etags? Can I use them for code completions?

  ;; All the tools in here require external dependencies:
  ;; - Language servers
  ;; - Formatters

  ;; I do not use eglot for formatting, instead deferring to apheleia which runs
  ;; my formatter asynchronously.
  (use-package apheleia
    :init
    (band-aid-parse-executable "black")
    ;; (band-aid-parse-executable "prettier")
    :config (apheleia-global-mode 1)
    :general
    (:states 'normal
     :prefix core-keybindings-leader-key
     "ta"))

  (use-package eglot
    :init
    (band-aid-parse-executable "pylsp")
    (band-aid-parse-executable "flake8")
    :hook
    ;; IDEA: These need to be separate sexps,
    ;; because they will ultimately be separate noweb styled code blocks.
    (python-mode . eglot-ensure)
    (terraform-mode . eglot-ensure)
    (nix-mode . eglot-ensure)
    (sql-mode . eglot-ensure)
    ;; IDEA: If eglot messes up some of my settings, I can use
    ;; `eglot-stay-out-of'. For example, (eglot-stay-out-of '(completion-styles))
    :config
    (setq-default
     eglot-workspace-configuration
     ;; IDEA: It would be nice to have refactoring capabilities with pylsp-rope.
     ;; Unfortunately, it is not packaged for Nix yet.
     '((pylsp
	(plugins
	 ;; I use apheleia + black for formatting so do not need autopep8.
	 (autopep8 (enabled . nil))
	 (pycodestyle (enabled . nil))
	 (flake8 (enabled . t))
	 (jedi_completion (fuzzy . t))))))
    :general
    (:states 'normal
     :prefix core-keybindings-leader-key
     "e" '(:ignore t :which-key "IDE")
     "ed" #'eglot-find-declaration
     "er" #'eglot-rename))

  (use-package flymake
    :general
    (:states 'normal
     :prefix core-keybindings-leader-key
     "ec" #'consult-flymake
     "ef" #'flymake-show-buffer-diagnostics
     "en" #'flymake-goto-next-error
     "ep" #'flymake-goto-prev-error))

  ;; TODO: Add keybindings for going to definition etc.
  (use-package xref)

#+end_src

** nix.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_nix.el

  (use-package nix-mode
    ;; The \\' matches the empty string.
    :mode "\\.nix\\'")

#+end_src

** org.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_org.el

  ;; TODO: Create a simple binding for previewing the entire buffer in LaTeX
  ;; TODO: This should be org-cdlatex-mode, but can't get it to work.
  (use-package org
    :custom
    ;; TODO: Does this work as a custom or does it need to be a default?
    (org-catch-invisible-edits 'show-and-error)
    (org-ellipsis " …")
    (org-pretty-entities t)
    (org-hide-emphasis-markers t)
    (org-startup-with-latex-preview t)
    :config
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("r" . "src R"))
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("sq" . "src sql"))
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python . t)
       (shell . t)
       (R . t)
       (sql . t)))
    (push '("conf-unix" . conf-unix) org-src-lang-modes))

  (use-package org-modern
    :custom (line-spacing 0.2)
    :config (global-org-modern-mode 1))

  ;; TODO: Does this interfere with org-modern?
  ;; TODO: Find out how well this works compared to the default.
  ;; (use-package valign
  ;;   :custom (valign-fancy-bar t)
  ;;   :hook (org-mode . valign-mode))

  (use-feature patches/01_org-sticky-header :after org-sticky-header)

  (use-package org-sticky-header
    :custom
    (org-sticky-header-full-path 'full)
    (org-sticky-header-heading-star "")
    :hook (org-mode . org-sticky-header-mode))

  (use-package toc-org
    :hook
    (org-mode . toc-org-mode)
    (markdown-mode . toc-org-mode))

  ;; BUG: This does not work together well with `diff-hl', because it ends
  ;; up creating a very large coloured block instead of a small fringe whenever
  ;; I changed, add or delete something to a git controlled file.
  ;; IDEA: Can I add `olivetti' and have it work together well with `visual-fill-column'
  ;; or is it a replacement of that package?
  (use-package visual-fill-column
    ;; What does visual-line-mode do? When does it trigger?
    :hook (visual-line-mode . visual-fill-column-mode)
    :custom (visual-fill-column-center-text t))

  (use-package org-appear
    :hook (org-mode . org-appear-mode))

  ;; TODO: Does this interfere with org-modern?
  ;; (use-package org-superstar
  ;;   :hook (org-mode . org-superstar-mode)
  ;;   :custom
  ;;   ;; org-superstar-cycle-headline-bullets: By default we cycle through the list.
  ;;   ;; org-superstar-leading-bullet: Also by default, the bullets are connected
  ;;   ;; by . to the left margin.
  ;;   ;; I can also add a lot of customization to TODOs.
  ;;   ;; org-superstar-item-bullet-alist also has good defaults.
  ;;   (org-superstar-headline-bullets-list '("◉" "○")))

#+end_src

