tfmacs/README.org
** persistence.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_persistence.el

  ;; This package remembers where the point was when the buffer was last visited.
  (use-package saveplace
    :custom (save-place-mode 1))

  ;; This package saves the minibuffer history.
  (use-package savehist
    :custom (save-hist-mode 1))

  ;; I do not like the automatic save after idling, because if I am typing,
  ;; pause at a space or tab and wait for too long, whitespace-cleanup-mode
  ;; will remove the space again. This can be annoying.
  ;; Generally speaking though, I don't pause after a space very often anyway.
  (use-package super-save
    ;; This hook ensures we do not need to click yes on the prompt asking us to save
    ;; when we try to quit Emacs.
    ;; Setting the default has the drawback that is tries to save also non-file buffers
    ;; such as the minibuffer. Hooking this after `find-file` will prevent this issue.
    ;; Since auto-save-mode is enabled by default, if Emacs ever crashes, we still have
    ;; the backups to recover from.
    ;; IDEA: Maybe do not change the colour of the filename if it needs saving anymore.
    ;; We are automatically saving anyway at every opportunity.
    :hook (find-file . (lambda () (setq buffer-save-without-query t)))
    :custom (super-save-mode 1))

  ;; There is a persistent-scratch-mode which remaps the save and write buffer
  ;; to their persistent-scratch counterparts. Should I hook this somehow?
  ;; No, not necessary. I shouldn't be trying to save automatically anyway.
  ;; super-save will do that for me automatically.
  (use-package emacs
    :straight (:type built-in)
    :custom (initial-scratch-message nil))

  ;; We protect the scratch buffer from accidentally being killed.
  ;; And if it does not exist, create it.
  (use-package protbuf
    :custom (protect-buffer-bury-p nil)
    :config
    ;; The scratch buffer SHOULD exist at this point. If it does not, I want to run into an error.
    (protect-buffer-from-kill-mode 1 (get-buffer "*scratch*")))

  (use-package persistent-scratch
    :custom
    (persistent-scratch-backup-directory
     (concat (file-name-as-directory no-littering-var-directory)
	     "persistent-scratch-backups"))
    ;; I do not use persistent-scratch-default-setup because it is not idempotent.
    ;; It toggles persistent-scratch-autosave-mode instead of setting it to t.
    (persistent-scratch-autosave-mode 1)
    :config
    ;; I am running this code only because it is a habit to call C-x C-s to save.
    ;; I want to be able to do this in the scratch buffer as well without being
    ;; asked to open a file to save to contents in.
    ;; It does not work though, not sure why not. Maybe better to not have it anyway? Autosave-mode works fine.
    ;; (with-current-buffer (get-buffer "*scratch*")
    ;;   (persistent-scratch-mode 1))
    (persistent-scratch--auto-restore))

  ;; (use-feature band-aid
  ;; :general
  ;; (:states 'normal
  ;;  :prefix core-keybindings-leader-key
  ;; IDEA: "ss" switch to scratch buffer
  ;; "sn" 'band-aid-scratch))

#+end_src

** python.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_python.el

  ;; pylsp-rope supposedly contains some nice refactoring capabilities
  (use-package python
    :config
    ;; We can use the :interpreter keyword
    (setq python-shell-interpreter "python3"
	  dap-python-executable "python3"
	  dap-python-debugger 'debugpy)
    :general
    (:states 'normal
     :prefix core-keybindings-leader-key
     "l"  '(:ignore t :which-key "languages")
     "lp" '(:ignore t :which-key "python")))

  ;; IDEA: Is poetry not enough? Do I still need pyvenv?
  (use-package pyvenv
    ;; TODO: The venv in the modeline does not look very nice. Can I give it a different face?
    :config (pyvenv-mode 1)
    :general
    (:states 'normal
     :prefix core-keybindings-leader-key
     "lpv"  '(:ignore t :which-key "pyvenv")
     "lpva" 'pyvenv-activate
     "lpvd" 'pyvenv-deactivate))

  (use-package poetry
    :general
    (:states 'normal
     :prefix core-keybindings-leader-key
     "lpp" 'poetry))

#+end_src

** repeating.el
Transients are useful for complicated menus bringing together various
commands or when state is required. Repeat mode on the other hand is
useful for simple commands that only need to be repeated a number of
times.

#+begin_src elisp :mkdirp yes :tangle tangled/config/01_repeating.el

  (use-package repeat
    :config (repeat-mode 1))

  ;; The default popup-type for repeat-help uses embark, not which-key.
  (use-package repeat-help
    :after (repeat embark)
    :custom (repeat-help-auto t)
    ;; IDEA: I can actually also hook repeat-help-mode after repeat-mode
    ;; and hook repeat-mode into the after-init hook. Would that be nicer?
    ;; Potentially, because it is more descriptive.
    ;; And can I do this for other modes as well?
    :config (repeat-help-mode 1))

  (use-package define-repeat-map
    :straight
    (:type git
     :host nil
     :repo "https://tildegit.org/acdw/define-repeat-map.el")
    :after repeat)

#+end_src

** roam.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_roam.el

  (use-package delve
    :straight (:type git :host github :repo "publicimageltd/delve")
    :after org-roam)

  (use-package org-roam
    ;; Note that we cannot currently use 01_org as a feature, because config is not in our load path.
    ;; Do we need this?
    :after org
    :custom
    ;; TODO: Try to create an overlay so I can use [[id:...]] and the title is always up to date
    ;; TODO: Make a hydra out of some of the roam commands
    (org-roam-directory
     (expand-file-name "org/notes" user-emacs-directory))
    (org-roam-completion-everywhere t)
    :config
    (band-aid-git-clone
     "git@gitlab.com:troy.figiel/zettelkasten.git"
     org-roam-directory)
    (org-roam-setup)
    (band-aid-org-roam-set-templates
     (expand-file-name "org/templates" user-emacs-directory))
    :general
    (:states 'normal
     :prefix core-keybindings-leader-key
     "r"   '(:ignore t :which-key "org-roam")
     "rb"  'org-roam-buffer-toggle
     "rn"  '(:ignore t :which-key "node")
     "rnf" 'org-roam-node-find
     "rni" 'org-roam-node-insert
     "rnr" 'org-roam-node-random
     "ra"  '(:ignore t :which-key "alias")
     "raa" 'org-roam-alias-add
     "rar" 'org-roam-alias-remove
     "rr"  '(:ignore t :which-key "ref")
     "rra" 'org-roam-ref-add
     "rrr" 'org-roam-ref-remove
     "rt"  '(:ignore t :which-key "tag")
     "rta" 'org-roam-tag-add
     "rtr" 'org-roam-tag-remove
     "ra"  '(:ignore t :which-key "add")))
  ;; (use-package org-roam-bibtex)

  (use-package org-roam-ui
    :after org-roam
    :diminish
    :custom
    (org-roam-ui-sync-theme t)
    (org-roam-ui-follow t)
    (org-roam-ui-update-on-save t)
    (org-roam-ui-open-on-start nil)
    :hook (after-init . org-roam-ui-mode))

  (use-package org-roam-timestamps
    :after org-roam
    :diminish
    :custom
    (org-roam-timestamps-remember-timestamps nil)
    :hook (after-init . org-roam-timestamps-mode))

  (use-package deft
    :after org-roam
    :custom
    ;; Need to figure out how deft works precisely
    (deft-recursive t)
    (deft-use-filter-string-for-filename t)
    (deft-default-extension "org")
    (deft-directory org-roam-directory)
    :general
    (:states 'normal
     :prefix core-keybindings-leader-key
     "rd"  'deft))

#+end_src

** system.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_system.el

  ;; BUG: My init system is not supported, even on Ubuntu. What am I doing wrong? Do I need sudo?
  (use-package daemons)

#+end_src

** terminal.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_terminal.el

  (use-package term
    :custom
    (explicit-shell-file-name "bash"))

  (use-package eterm-256color
    :hook (term-mode . eterm-256color-mode))

  (use-package tldr
    ;; IDEA: I should not always have to contact GitHub for updates.
    ;; Maybe I should turn this into a transient?
    :config (tldr-update-docs))

#+end_src

** text-editing.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_text-editing.el

  (use-package undo-fu)

  (use-package undo-fu-session)
  ;; (use-package undo-fu-session
  ;;   :custom (global-undo-fu-session-mode 1))

  (use-package vundo)

  (use-package default-text-scale)

  ;; TODO: Figure out when we actually get ^L characters instead of line breaks.
  ;; Dashboard works fine, right?
  (use-package page-break-lines
    :config (global-page-break-lines-mode 1))

  ;; IDEA: Spellchecking probably needs to be turned off in other file types as well.
  ;; I should think of which other ones.
  ;; Examples: csv
  (use-package flyspell
    :straight (:type built-in)
    :hook
    (text-mode . flyspell-mode)
    (prog-mode . flyspell-prog-mode))

#+end_src

