tfmacs/README.org
** theming.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/00_theming.el

  (defvar tf/default-font-size 120)
  (defvar tf/default-variable-font-size 120)

  (set-face-attribute 'default nil :height tf/default-font-size)

  ;; Set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil :height tf/default-font-size)

  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil :height tf/default-variable-font-size :weight 'regular)

  (defvar tf/frame-transparency '(100 . 100))

  (set-frame-parameter (selected-frame) 'alpha tf/frame-transparency)
  (add-to-list 'default-frame-alist `(alpha . ,tf/frame-transparency))

  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

  (use-package hide-mode-line
    :hook (dashboard-after-initialize . hide-mode-line-mode))

  (use-package dashboard
    :custom
    (dashboard-startup-banner 'logo)
    (dashboard-center-content t)
    (dashboard-set-heading-icons t)
    (dashboard-set-file-icons t)
    ;; It is a bit strange I have to set this to a value different from projectile.
    ;; If I don't do this and try to show projects, it will pull in projectile instead
    ;; of using project.el.
    (dashboard-projects-backend 'project-el)
    (dashboard-items
     '((recents  . 10)
       (bookmarks . 5)
       (projects . 5)
       (agenda . 5)))
    :config (dashboard-setup-startup-hook))

  (use-package beacon
    :custom (beacon-blink-duration 0.5)
    :config (beacon-mode 1))

  (use-package all-the-icons
    :unless (find-font (font-spec :name "all-the-icons"))
    :config (all-the-icons-install-fonts t))

  (use-package all-the-icons-dired
    :after (all-the-icons dired)
    :hook (dired-mode . all-the-icons-dired-mode))

  (use-package autorevert
    :straight (:type built-in))

  ;; NOTE: How can bufler and consult work together?
  (use-package bufler
    :custom
    (bufler-workspace-mode 1))

  (use-package zoom
    ;; Golden ratio. Just kind of looks nice.
    :custom (zoom-size '(0.618 . 0.618))
    :config (zoom-mode 1))

  ;; I need to add some mode-icons that are missing.
  (use-package mode-icons
    :custom (mode-icons-show-mode-name t)
    :config (mode-icons-mode 1))

  ;; IDEA: I would like my org #+begin_src and #+end_src line to have a slightly darker colour.
  ;; How do I set this? Would this be superfluous with the right org-modern settings?
  (use-package doom-themes
    :custom (doom-themes-padded-modeline t)
    :config (load-theme 'doom-vibrant t))

  (use-package doom-modeline
    :custom
    (doom-modeline-minor-modes t)
    (doom-modeline-vcs-max-length 24)
    :config (doom-modeline-mode 1))

  (use-package minions
    :custom (minions-mode t))

  (use-package dimmer
    :custom
    (dimmer-fraction 0.35)
    (dimmer-mode 1)
    :config
    (dimmer-configure-company-box)
    (dimmer-configure-magit)
    (dimmer-configure-org)
    (dimmer-configure-which-key)
    (dimmer-configure-posframe))

  (use-package solaire-mode
    ;; IDEA: This is not very consistent.
    ;; It is better if I change the function that determines what is a real buffer.
    ;; Buffers *dashboard*, " *ivy-posframe-buffer*"
    ;; I can set band-aid-solaire-mode-excluded-buffers and a function band-aid-solaire-mode-real-buffer-p that excludes the excluded buffers from solaire mode.
    :hook
    (dashboard-after-initialize . turn-off-solaire-mode)
    :config (solaire-global-mode 1))

#+end_src

** version-control.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_version-control.el

  ;; IDEA: I should set up pretty-magit. This integrates well with conventional commits.
  (use-package magit
    :custom
    (magit-display-buffer-function
     #'magit-display-buffer-same-window-except-diff-v1)
    (vc-follow-symlinks t)
    :general
    ;; BUG: These keybindings do not work in dired. Why not? Wrong keymap?
    (:states 'normal
     :prefix core-keybindings-leader-key
     "g"  '(:ignore t :which-key "git")
     "gs" 'magit-status))

  (use-package hl-todo
    :custom
    (hl-todo-keyword-faces
     '(("TODO" . "#cc9393")
       ("TODOC" . "#afd8af")
       ("BUG" . "#d0bf8f")
       ("IDEA" . "#7cb8bb")))
    :config (global-hl-todo-mode 1))

  ;; BUG: My magit-todos disappears in the nix-shell. Why does this happen?
  ;; Am I missing a required package?
  ;; IDEA: Unfortunately, magit-todos calls the sections "TODOs" and this
  ;; value is hard coded throughout the code. It is possible to fix this
  ;; using el-patch but it is too much effort for now.
  ;; BUG: Even if I remove ".git/" from the magit-todos-exclude-glob
  ;; it seems not to find the TODOs anyway. Can I figure out why?
  (use-package magit-todos
    :after hl-todo
    ;; BUG: It does not seem like magit-todos-branch-list works flawlessly. For example,
    ;; it does not seem to take into account the `magit-todos-keyword' suffix variable
    ;; and greps for all TODOs instead.
    :custom (magit-todos-branch-list nil)
    ;; `magit-todos-max-items' determines when a section should automatically collapse.
    ;; The default setting of 10 is a reasonable number.
    ;; (magit-todos-max-items 10)
    ;; TODOC: I do not know what this variable actually does.
    ;; I leave it set to the default of 20.
    ;; (magit-todos-auto-group-items 20)
    :config
    ;; I do not need to see the TODOs in the README,
    ;; because they already show up in my config directory.
    ;; Having them show up in my config directory gives a clearer
    ;; semantic separation as well.
    ;; This is why I have added the README file to .dir-locals.el.
    ;; It also means I need to add the README file to my safe-local-variable-values.
    (add-to-list 'safe-local-variable-values `(magit-todos-exclude-globs . (,core-literate-config-file)))
    (magit-todos-mode 1))

  ;; IDEA: What is diff-hl-magit? Should I add a hook for that?
  (use-package diff-hl
    :hook (dired-mode . diff-hl-dired-mode)
    :custom
    (diff-hl-margin-symbols-alist
     ;; I prefer to use background colours instead.
     '((insert . " ")
       (delete . " ")
       (change . " ")
       (unknown . "?")
       (ignored . "i")))
    ;; This mode will instantly show changes instead of only after saving the file.
    ;; I like the immediate feedback better. Especially because if I am using super
    ;; save mode, I should not have to think about saving at all.
    (diff-hl-flydiff-mode 1)
    ;; TODOC: What difference does this mode actually make? The help was not that clear.
    (diff-hl-margin-mode 1)
    (global-diff-hl-mode 1)
    :custom-face
    ;; IDEA: I am setting both the foreground and background colour now.
    ;; What is the difference and do we need to set both?
    (diff-hl-insert ((t (:foreground "#7bc275" :background "#7bc275"))))
    (diff-hl-delete ((t (:foreground "#ff665c" :background "#ff665c"))))
    (diff-hl-change ((t (:foreground "#fcce7b" :background "#fcce7b")))))

  ;; BUG: Both of these packages have some problems upon loading.
  ;;(use-package git-timemachine)
  ;;(use-package git-undo)

  (use-package forge
    :custom
    ;; Set maximum open issues shown in forge to 200.
    ;; Function forge-toggle-closed-visibility changes the sign of -200.
    (forge-topic-list-limit '(200 . -200))
    (forge-alist
     '(("gitlab.justdice-ops.io"
	"gitlab.justdice-ops.io/api/v4"
	"gitlab.justdice-ops.io"
	forge-gitlab-repository)
       ("github.com"
	"api.github.com"
	"github.com"
	forge-github-repository)
       ("gitlab.com"
	"gitlab.com/api/v4"
	"gitlab.com"
	forge-gitlab-repository)))
    :config
    ;; This will need to be set before magit! Does not work otherwise.
    (setq forge-add-default-bindings nil))

  (use-package git-modes
    :mode ("\\.dockerignore\\'" . 'gitignore-mode))

    #+end_src

