tfmacs/README.org
** whitespace.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_whitespace.el

  (use-package whitespace-cleanup-mode
    :hook (prog-mode text-mode))

  ;; BUG: The dim grey background does show up in commit messages. I need to exclude these.
  ;; BUG: The same is true for ein.
  (use-feature band-aid
    :custom-face
    ;; IDEA: Not the nicest, but better than red. Can I make it a bullet instead?
    (trailing-whitespace ((t :background "dim grey")))
    :hook
    ((prog-mode text-mode) . band-aid-show-trailing-whitespace))

#+end_src

** window.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_window.el

  (use-package winner
    :straight (:type built-in)
    :custom
    (winner-mode 1))

#+end_src

** workspaces.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/01_workspaces.el

  (use-package burly)

#+end_src

** keybindings.el
#+begin_src elisp :mkdirp yes :tangle tangled/config/02_keybindings.el

  (general-define-key
   "s-b" 'consult-buffer)

  (general-define-key
   "s-q" 'delete-window
   "s-u" 'winner-undo
   "s-f" 'find-file)

  (general-define-key
   "s-1" 'delete-other-windows
   "s-2" 'split-window-below
   "s-3" 'split-window-right)

  (general-create-definer tf/extra-keys
    :prefix tf-keybindings/extra-prefix)

  (tf/extra-keys
    tf-keybindings/extra-prefix 'tf-core/redefine-shortcut)

  (tf/extra-keys
    "t"  '(:ignore t :which-key "toggle")
    "td" 'toggle-debug-on-error
    "tw" 'whitespace-mode
    "tl" 'display-line-numbers-mode
    "tt" 'consult-theme)
  ;; Does not work yet because I removed hydras
  ;;"ts" '(tf/hydra-text-scale/body :which-key "tf/hydra-text-scale"))

  (tf/extra-keys
    "o"   '(:ignore t :which-key "org")
    "oo"  'org-open-at-point
    "ob"  '(tf/hydra-org-babel/body :which-key "tf/hydra-org-babel"))

  (tf/extra-keys
    "e"  '(:ignore t :which-key "eval")
    "eb" 'eval-buffer)

  (tf/extra-keys
    :keymaps '(visual)
    "er" 'eval-region)

  (tf/extra-keys
    "g"  '(:ignore t :which-key "git")
    "gt" 'git-timemachine
    "gl" 'git-link
    "gi" 'magit-init)

  (general-create-definer tf/fast-keys
    :prefix tf-keybindings/fast-prefix)

  (tf/fast-keys
    "c"   'evil-avy-goto-char-2
    "g"   'magit-status
    "i"   'crux-find-user-init-file
    "l"   'evil-avy-goto-line
    ;;"m" 'evil-avy-pop-mark
    ;; "s" something with scratch buffer
    "k" '(lambda () (interactive) (kill-buffer (current-buffer))))

  ;; (use-package helpful
  ;;   :bind
  ;;   ([remap describe-function] . counsel-describe-function)
  ;;   ([remap describe-command] . helpful-command)
  ;;   ([remap describe-variable] . counsel-describe-variable)
  ;;   ([remap describe-key] . helpful-key))

  (define-key global-map (kbd "C-c j")
    (lambda () (interactive) (org-capture nil "jj")))

#+end_src

* Patches
** asdf-reshim
#+begin_src elisp :mkdirp yes :tangle tangled/patches/01_asdf-reshim.el

  (defun asdf-reshim ()
    (interactive)
    (shell-command (asdf--command "reshim")))

#+end_src

** asdf-transient
#+begin_src elisp :mkdirp yes :tangle tangled/patches/01_asdf-transient.el

  (use-package transient)

  (transient-define-prefix asdf ()
    "asdf menu."
    [["Packages"
      ("c" "current" asdf-current)
      ("i" "install" asdf-install)
      ("r" "reshim" asdf-reshim)]
     ["Plugins"
      ("a" "add" asdf-plugin-add)
      ("l" "list" asdf-plugin-list)]])

#+end_src

** org-sticky-header
#+begin_src elisp :mkdirp yes :tangle tangled/patches/01_org-sticky-header.el

  ;; Make sure we do not get an additional asterisk if we are not using indent mode.
  (el-patch-feature org-sticky-header)
  (with-eval-after-load 'org-sticky-header
    (el-patch-defun org-sticky-header--indent-prefix ()
      "Return indentation prefix for heading at point.
  This will do the right thing both with and without `org-indent-mode'."
      ;; Modelled after `org-indent-set-line-properties'
      (let* ((level (org-current-level))
	     (indent-mode (bound-and-true-p org-indent-mode))
	     (npre (if (<= level 1) 0
		     (+ (if indent-mode
			    (* (1- org-indent-indentation-per-level)
			       (1- level))
			  0)
			level -1)))
	     (prefix (concat (make-string npre (el-patch-splice 2 1 (if indent-mode ?\ ?*))) org-sticky-header-heading-star " ")))
	(org-add-props prefix nil 'face
		       (if org-cycle-level-faces
			   (setq org-f (nth (% (1- level) org-n-level-faces) org-level-faces))
			 (setq org-f (nth (1- (min level org-n-level-faces)) org-level-faces)))))))

#+end_src

** lisp
#+begin_src elisp :mkdirp yes :tangle tangled/patches/01_lisp.el

  ;; Fix the indentation of keyword lists in Emacs Lisp. See [1] and [2].

  ;; Before:
  ;;  (:foo bar
  ;;        :baz quux)

  ;; After:
  ;;  (:foo bar
  ;;   :bar quux)

  ;; [1]: https://github.com/Fuco1/.emacs.d/blob/af82072196564fa57726bdbabf97f1d35c43b7f7/site-lisp/redef.el#L12-L94
  ;; [2]: http://emacs.stackexchange.com/q/10230/12534
  (el-patch-defun lisp-indent-function (indent-point state)
    "This function is the normal value of the variable `lisp-indent-function'.
  The function `calculate-lisp-indent' calls this to determine
  if the arguments of a Lisp function call should be indented specially.
  INDENT-POINT is the position at which the line being indented begins.
  Point is located at the point to indent under (for default indentation);
  STATE is the `parse-partial-sexp' state for that position.
  If the current line is in a call to a Lisp function that has a non-nil
  property `lisp-indent-function' (or the deprecated `lisp-indent-hook'),
  it specifies how to indent.  The property value can be:
   ,* `defun', meaning indent `defun'-style
   (this is also the case if there is no property and the function
   has a name that begins with \"def\", and three or more arguments);
   ,* an integer N, meaning indent the first N arguments specially
   (like ordinary function arguments), and then indent any further
   arguments like a body;
   ,* a function to call that returns the indentation (or nil).
   `lisp-indent-function' calls this function with the same two arguments
   that it itself received.
  This function returns either the indentation to use, or nil if the
  Lisp function does not specify a special indentation."
    (el-patch-let (($cond (and (elt state 2)
			       (el-patch-wrap 1 1
				 (or (not (looking-at "\\sw\\|\\s_"))
				     (looking-at ":")))))
		   ($then (progn
			    (if (not (> (save-excursion (forward-line 1) (point))
					calculate-lisp-indent-last-sexp))
				(progn (goto-char calculate-lisp-indent-last-sexp)
				       (beginning-of-line)
				       (parse-partial-sexp (point)
							   calculate-lisp-indent-last-sexp 0 t)))
			    ;; Indent under the list or under the first sexp on the same
			    ;; line as calculate-lisp-indent-last-sexp.  Note that first
			    ;; thing on that line has to be complete sexp since we are
			    ;; inside the innermost containing sexp.
			    (backward-prefix-chars)
			    (current-column)))
		   ($else (let ((function (buffer-substring (point)
							    (progn (forward-sexp 1) (point))))
				method)
			    (setq method (or (function-get (intern-soft function)
							   'lisp-indent-function)
					     (get (intern-soft function) 'lisp-indent-hook)))
			    (cond ((or (eq method 'defun)
				       (and (null method)
					    (> (length function) 3)
					    (string-match "\\`def" function)))
				   (lisp-indent-defform state indent-point))
				  ((integerp method)
				   (lisp-indent-specform method state
							 indent-point normal-indent))
				  (method
				   (funcall method indent-point state))))))
      (let ((normal-indent (current-column))
	    (el-patch-add
	      (orig-point (point))))
	(goto-char (1+ (elt state 1)))
	(parse-partial-sexp (point) calculate-lisp-indent-last-sexp 0 t)
	(el-patch-swap
	  (if $cond
	      ;; car of form doesn't seem to be a symbol
	      $then
	    $else)
	  (cond
	   ;; car of form doesn't seem to be a symbol, or is a keyword
	   ($cond $then)
	   ((and (save-excursion
		   (goto-char indent-point)
		   (skip-syntax-forward " ")
		   (not (looking-at ":")))
		 (save-excursion
		   (goto-char orig-point)
		   (looking-at ":")))
	    (save-excursion
	      (goto-char (+ 2 (elt state 1)))
	      (current-column)))
	   (t $else))))))

#+end_src

* Experimentation
** [[https://github.com/rejeep/drag-stuff.el][Drag-stuff]]
#+begin_src elisp

  (use-package drag-stuff)

#+end_src

** [[https://github.com/emacsfodder/move-text][Move-text]]
Why would I prefer drag-stuff over move-text or vice versa? Move-text
has some issues with dragging regions.
#+begin_src elisp

  (use-package move-text)

#+end_src

** Buffer removal
- Kill a buffer directly from buffer search
- Be able to delete the current buffer as file

** LaTeX command shortcuts
- LaTeX- Quick command for \intercal = transpose symbol
- Quick command for \cap = intersection symbol
- Quick command for \leq and \geq as well as \ll and \gg
- Have some macros for common expressions like \mathbb{E}[...] and \mathbb{P}[...]
- Quick command for \sim
- Quick command for \sqrt
- I need a way to easily set up a matrix environment, align, equations, etc. Whether with begin and
  end or brackets.
- Have macros for \( and \[ environments

** [[https://github.com/joaotavora/yasnippet][Yasnippet]]
#+begin_src elisp

  (use-package yasnippet)

#+end_src

** [[https://github.com/karthink/popper][Popper]]
#+begin_src elisp

  (use-package popper)

#+end_src

** [[https://depp.brause.cc/shackle/][Shackle]]
#+begin_src elisp

  (use-package shackle)

#+end_src

** [[https://github.com/kostafey/ejc-sql][Ejc-sql]]
I have not tried this out with a database yet. I can give it a try
with a local SQLite database and later with Athena or Redshift.

#+begin_src elisp

  (use-package ejc-sql
    :hook (ejc-sql-minor-mode . company-mode))

  (use-package ejc-company
    :straight ejc-sql
    :config (add-to-list 'company-backends 'ejc-company-backend)
    ;; Not necessary if company-minimum-prefix-length = 0
    :custom (ejc-complete-on-dot t))

#+end_src

I will need to create connections in the following way:

#+begin_src elisp

  (ejc-create-connection
   "MariaDB-db-connection"
   :dependencies [[org.mariadb.jdbc/mariadb-java-client "2.6.0"]]
   :classname "org.mariadb.jdbc.Driver"
   :connection-uri "jdbc:mariadb://localhost:3306/db_name"
   :user "a_user"
   :password "secret")

#+end_src

** ElDoc
This is a built-in package that can integrate with ejc-sql. How
exactly and why?

** [[https://github.com/Malabarba/aggressive-indent-mode][Aggressive-indent-mode]]
A replacement of electric-indent-mode?

#+begin_src elisp

  (use-package aggressive-indent)

#+end_src

** [[https://github.com/hlissner/evil-snipe][Evil-snipe]]
#+begin_src elisp

  (use-package evil-snipe)

#+end_src

** Desktop
Desktop-save-mode did not work immediately as expected. It will ask me
if I want to save my desktop and if I say yes, I ended up conflicting
with straight telling me my sources are out of date.

Can I reproduce this? Was it a one-off error?

#+begin_src elisp

  (use-package desktop
    :straight (:type built-in))
    ;; :config
    ;; (desktop-save-mode 1))

#+end_src

** [[https://github.com/anticomputer/ovpn-mode][ovpn-mode]]
I need to first set the directories in which my ovpn configurations are stored.

#+begin_src elisp

 (use-package ovpn-mode)

#+end_src

** [[https://github.com/protesilaos/fontaine][fontaine]]
#+begin_src elisp

  (use-package fontaine)

#+end_src

** [[https://github.com/iqbalansari/emacs-emojify][emojify]]
#+begin_src elisp

  (use-package emojify
    :hook (after-init . global-emojify-mode))

#+end_src

** flycheck-inline
#+begin_src elisp

  (use-package flycheck)
  (use-package flycheck-inline)

#+end_src

** [[https://github.com/narendraj9/hledger-mode][hledger-mode]] / [[https://github.com/DamienCassou/flycheck-hledger][flycheck-hledger]]
#+begin_src elisp

  (use-package hledger-mode
    :mode "\\.journal\\'"
    :custom
    (hledger-jfile "~/journal-file.journal")
    (add-to-list 'company-backends #'hledger-company))

  (use-package flycheck-hledger
    :after (flycheck hledger-mode))

#+end_src

** [[https://github.com/magnars/multiple-cursors.el][multiple-cursors]]
This kind of functionality is standard in other IDEs. I am not
convinced it is very useful in Emacs though. When would I really use
it?

#+begin_src elisp

  (use-package multiple-cursors)

#+end_src

** [[https://github.com/jwiegley/git-undo-el][git-undo]]
I get a warning about cl being deprecated. Does this package still
work?

#+begin_src elisp

  (use-package git-undo)

#+end_src

** [[https://github.com/magnars/expand-region.el][expand-region]]
There seems to be a lot of functionality that I have never even seen
or tried out. What are all the things I can do with this package?

#+begin_src elisp

  (use-package expand-region)
  (global-set-key (kbd "C-<right>") 'er/expand-region)
  (global-set-key (kbd "C-<left>") 'er/contract-region)

#+end_src

** [[https://github.com/mrkkrp/fix-word][fix-word]]
Uppercase, lowercase or capitalize words.

#+begin_src elisp

  (use-package fix-word)

#+end_src

** [[https://gitlab.com/Vonfry/zoxide.el][zoxide]]
It is not completely clear to me what this package can do.

#+begin_src elisp

  (use-package zoxide)

#+end_src

** [[https://github.com/benma/visual-regexp-steroids.el][visual-regexp-steroids]]
I also do not know exactly what this package does.

#+begin_src elisp

  (use-package visual-regexp-steroids)

#+end_src

** [[https://github.com/dengste/minimap][minimap]]
I am wondering how useful this will be for my developer experience. I
have never felt like I was missing a minimap when developing in
PyCharm for example.

It seems I have some trouble disabling the minimap. If I disable
minimap-mode, the minimap still shows. It also seems minimap-kill does
not stop the minimap from showing.
#+begin_src elisp

  (use-package minimap
    :custom (minimap-major-modes '(prog-mode org-mode)))

#+end_src

** firestarter
This is a package that automatically runs code (shell scripts, elisp
code, etc.) upon saving. This could be very helpful when I need to
compile a text file to a pdf for example.

There are definitely a lot of uses, but I am wondering whether running
commands every save is not too slow. For example, running tests each
save might be too much?

#+begin_src elisp

  (use-package firestarter)

#+end_src

** [[https://github.com/nobiot/org-transclusion][org-transclusion]]

#+begin_src elisp

  (use-package org-transclusion
    :config
    ;; IDEA: How could I make org-transclusion work best? With indices and fact sheets?
    ;; TODO: Figure out how to get a properly indented fringe. Now it looks like the transcluded block is part of the original file. Maybe some sidebar to indicate it is "collapsible"?
    (add-to-list 'org-transclusion-exclude-elements 'keyword)
    ;; TODO: I can get it to work like this, but not in the hook of use-package. Fix this.
    :hook (org-transclusion-after-add-functions . #'(lambda (_beg _end) (org-latex-preview '(16)))))

  (set-face-attribute
   'org-transclusion-source-fringe nil
   :foreground "green"
   :background "green")

  (set-face-attribute
   'org-transclusion-fringe nil
   :foreground "green"
   :background "green")

#+end_src

** [[https://github.com/emacs-lsp/dap-mode][dap-mode]]
#+begin_src elisp

  (use-package dap-mode)

#+end_src

** [[https://github.com/jkitchin/org-ref][org-ref]]
#+begin_src elisp

  ;; (use-package org-ref)

#+end_src

